In [1]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

SyntaxError: invalid syntax (3998113497.py, line 1)

In [ ]:
# Ans
import pandas as pd

In [ ]:
ds=pd.Series([4,8,15,16,23,42])

In [ ]:
ds

In [ ]:
type(ds)

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [ ]:
import pandas
var=[0,1,2,3,4,5,6,7,8,9]
pandas.Series(var)

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [ ]:

import pandas as pd
  
data = [['Alice', 25,'Female'], ['Bob',30, 'male'], ['Claire', 27,"female"]]
  
df = pd.DataFrame(data, columns=['Name', 'Age','Gender'])
  
# print dataframe
df

In [ ]:
type(df)

In [ ]:
import pandas as pd
  
# initialize data of lists.
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender':['Female','Male','Female']}
  
# Create DataFrame
df = pd.DataFrame(data)
  
# Print the output.
df

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Ans Series
    A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. 
    It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.
    
    DataFrame
    A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

In [3]:
import pandas as pd
  
# initialize data of lists.
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender':['Female','Male','Female']}

In [4]:
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [5]:
df = pd.Series(data)
df

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [6]:
data = [{'Name': 'Kaarun', 'Class': 'B tech', 'Roll': 3232},
        {'Name': 'Deepak', 'Class': 'B tech', 'Roll': 3244},
        {'Name': 'Archana', 'Class': 'B tech', 'Roll': 3252},
        {'Name': 'Shubham', 'Class': 'B tech', 'Roll': 3262},
        {'Name': 'Rosan', 'Class': 'B tech', 'Roll': 3272}]
        

df = pd.DataFrame(data)
  
# Print the data
df

      Name   Class  Roll
0   Kaarun  B tech  3232
1   Deepak  B tech  3244
2  Archana  B tech  3252
3  Shubham  B tech  3262
4    Rosan  B tech  3272

In [11]:
df[['Name']][2:5]

      Name
2  Archana
3  Shubham
4    Rosan

In [8]:
list(df.columns)

['Name', 'Class', 'Roll']

In [15]:
df[['Roll']]

   Roll
0  3232
1  3244
2  3252
3  3262
4  3272

In [17]:
df[0:3]

      Name   Class  Roll
0   Kaarun  B tech  3232
1   Deepak  B tech  3244
2  Archana  B tech  3252

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Ans DataFrame

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
import pandas as pd
courses = pd.Series(["Spark","PySpark","Hadoop"],name="course")
fees = pd.Series([22000,25000,23000],name="fees")
discount  = pd.Series([1000,2300,1000],name="discount")

In [30]:
df=pd.concat([courses,fees,discount],axis=1)
df

    course   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000